Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: and note its client id and client secret properties, use them to configure your `application.properties`:
ja_jp: クライアントIDとクライアント・シークレットのプロパティをメモしておき、 `application.properties` の設定に使用する：

source: and now end it in the second service (the one running on port 8081):
ja_jp: これを、2つ目のサービス（ポート8081で動作しているもの）で終了させます。

source: and open `http://localhost:8080/coffee` in your browser. Make a couple of requests (remember, some of them are expected to fail). At least some requests should show us the list of our coffee samples in JSON, the rest will fail with a `RuntimeException` thrown in `CoffeeResource#maybeFail()`.
ja_jp: `http://localhost:8080/coffee` をブラウザで開きます。いくつかのリクエストを行います（いくつかのリクエストは失敗することを想定しています）。少なくともいくつかのリクエストは、コーヒーサンプルのリストをJSONで表示してくれるはずです。残りのリクエストは、 `CoffeeResource#maybeFail()` 内で `RuntimeException` をスローして失敗します。

source: and open `http://localhost:8080/coffee` in your browser. Make couple of requests (remember, some of them we expect to fail). At least some of the requests should show us the list of our coffee samples in JSON, the rest will fail with a `RuntimeException` thrown in `CoffeeResource#maybeFail()`.
ja_jp: そして `http://localhost:8080/coffee` をブラウザで開いてください。いくつかのリクエストをしてみてください (いくつかは失敗することが予想されることを覚えておいてください)。少なくともいくつかのリクエストでは、コーヒーサンプルのリストを JSON で表示するでしょう、そして残りのリクエストでは `RuntimeException` が `CoffeeResource#maybeFail()` で発生するでしょう。

source: and rather write `/webjars/jquery/jquery.min.js` instead of `/webjars/jquery/3.1.1/jquery.min.js` in your HTML files, you can add the `quarkus-webjars-locator` extension to your project. To use it, add the following to your project's dependencies:
ja_jp: HTMLファイルに `/webjars/jquery/3.1.1/jquery.min.js` の代わりに `/webjars/jquery/jquery.min.js` と書き、プロジェクトに `quarkus-webjars-locator` という拡張を追加することができます。これを使用するには、プロジェクトの依存関係に以下を追加します。

source: and reload the last requested page in case of a `499` status code.
ja_jp: ステータスコードが `499` の場合は、最後にリクエストされたページを再度読み込みます。

source: and run it with:
ja_jp: 次に、それを実行します。

source: and set the Quarkus properties to select the flavor, or kube version.
ja_jp: そして、Quarkusプロパティを設定してフレーバー、つまりkubeバージョンを選択します。

source: and since http://stage.code.quarkus.io/api responds with 302 status code we need to also skip the tests with `-DskipTests`.
ja_jp: また、 http://stage.code.quarkus.io/api は 302 ステータスコードで応答するので、 `-DskipTests` のテストもスキップする必要があります。

source: and since, by default, quarkus only allows one application per deployment you will need to add the the following property to the application config file (`src/main/resources/application.properties`):
ja_jp: また、デフォルトでは、Quarkusは1つのデプロイメントにつき1つのアプリケーションしか許可しないため、アプリケーション設定ファイル( `src/main/resources/application.properties`)に以下のプロパティを追加する必要があります。

source: and specify the host and port of your Logstash endpoint. To be ECS compliant, specify the log format.
ja_jp: Logstash エンドポイントのホストとポートを指定します。ECS に準拠するには、ログ形式を指定します。

source: and start a second service instance (on port 8082):
ja_jp: そして2つ目のサービスインスタンス（ポート8082）を起動します。

source: and the BouncyCastle TLS dependency optimized for using the BouncyCastle FIPS provider:
ja_jp: そして、BouncyCastle FIPSプロバイダを使用するために最適化されたBouncyCastle TLS依存関係:

source: and the `password.txt` file containing the user and encrypted password:
ja_jp: ユーザーと暗号化されたパスワードを含む `password.txt` ファイルの場合:

source: and the applicant who requested it
ja_jp: そしてその申請者の 2 つのクラスのみで構成されています。

source: and the following request:
ja_jp: 以下のリクエストの場合:

source: and then run with:
ja_jp: 次に、以下を実行してください:

source: and then you can use `OidcClient.accessTokens` method accepting a Map of extra properties and pass the current `code` and `redirect_uri` parameters to exchange the authorization code for the tokens.
ja_jp: 次に、追加のプロパティーのマップを受け入れる `OidcClient.accessTokens` メソッドを使用し、現在の `code` パラメーターと `redirect_uri` パラメーターを渡して、トークンの認可コードを交換できます。

source: and then you can use `OidcClient.refreshTokens` method with a provided refresh token to get the access token.
ja_jp: 続いて、提供されたリフレッシュトークンを使って `OidcClient.refreshTokens` メソッドを使用して、アクセストークンを取得することができます。

source: and update `application.properties` to get all the CDI producers provided by `smallrye-jwt` included as follows:
ja_jp: さらに、 `application.properties` を更新して、 `smallrye-jwt` によって提供されるすべての CDI プロデューサーを次のように含めます。

source: and use a custom `TenantConfigResolver` to resolve it:
ja_jp: そして、カスタム `TenantConfigResolver` を使って解決します:

source: and use our standard datasource configuration infrastructure.
ja_jp: これで、標準的なデータソース設定基盤を使用できます。

source: and use the following request:
ja_jp: 次のリクエストを使用します。

source: and use this in your other test classes as follows:
ja_jp: そして、これを次のように他のテストクラスで使用します。

source: and use this token to call `/frontend/user-name-with-propagated-token` and `/frontend/admin-name-with-propagated-token`:
ja_jp: このトークンを使用して、 `/frontend/user-name-with-propagated-token` と `/frontend/admin-name-with-propagated-token` を呼び出します。

source: and write a simpler API sequence:
ja_jp: より単純な API シーケンスを記述します。

source: and write a test code like this one:
ja_jp: 次のようなテストコードを作成します。

source: and you should see output similar to:
ja_jp: 次のような出力が得られるはずです。

source: and your configuration indicates that the `generated-price` channel uses the `smallrye-kafka` connector, then Quarkus will automatically set the `value.serializer` to Kafka's built-in `IntegerSerializer`.
ja_jp: 設定において `generated-price` チャネルが `smallrye-kafka` コネクターを使用することを示している場合、Quarkus は自動的に `value.serializer` を Kafka の組み込みの `IntegerSerializer` に設定します。

source: and your configuration indicates that the `generated-price` channel uses the `smallrye-pulsar` connector, then Quarkus will automatically set the `schema` attribute of the `generated-price` channel to Pulsar Schema `INT32`.
ja_jp: このとき、設定において `generated-price` チャネルで `smallrye-pulsar` コネクターを使用するよう指定されていると、Quarkus は `generated-price` チャネルの `schema` 属性を Pulsar Schema `INT32` に自動的に設定します。

source: and your configuration indicates that the `my-kafka-records` channel uses the `smallrye-kafka` connector, then Quarkus will automatically set the `key.deserializer` to Kafka's built-in `LongDeserializer`, as well as the `value.deserializer` to `ByteArrayDeserializer`.
ja_jp: 設定において `my-kafka-records` チャネルが `smallrye-kafka` コネクターを使用することを示している場合、Quarkus は自動的に `key.deserializer` を Kafka の組み込み `LongDeserializer` に設定し、同様に `value.deserializer` を `ByteArrayDeserializer` に設定します。

source: and your configuration indicates that the `my-pulsar-consumer` channel uses the `smallrye-pulsar` connector, then Quarkus will automatically set the `schema` attribute to Pulsar `BYTES` Schema.
ja_jp: 設定において `my-pulsar-consumer` チャネルで `smallrye-pulsar` コネクターを使用するよう指定されていると、Quarkus は `schema` 属性を Pulsar `BYTES` Schema に自動的に設定します。

source: and your configuration indicates that the `price-create` channel uses the `smallrye-kafka` connector, then Quarkus will automatically set the `value.serializer` to Kafka's built-in `DoubleSerializer`.
ja_jp: 設定において `price-create` チャネルが `smallrye-kafka` コネクターを使用することを示している場合、Quarkus は自動的に `value.serializer` を Kafka の組み込みの `DoubleSerializer` に設定します。

source: and your configuration indicates that the `price-create` channel uses the `smallrye-pulsar` connector, then Quarkus will automatically set the `schema` to Pulsar `INT64` Schema.
ja_jp: 設定において `price-create` チャネルが `smallrye-pulsar` コネクターを使用するよう指定されていると、Quarkus は `schema` を Pulsar `INT64` Schema に自動的に設定します。

source: and, finally, print the stack trace:
ja_jp: そして最後に、スタックトレースを出力します。

source: annotate your entities with `@Entity`
ja_jp: エンティティに `@Entity` アノテーションを付けます

source: annotate your entities with `@Entity` and any other mapping annotation as usual
ja_jp: エンティティーに `@Entity` やその他のマッピングアノテーションを通常どおりにアノテーションします。

source: annotate your entities with `@Entity` and any other mapping annotations as usual
ja_jp: エンティティに `@Entity` やその他のマッピングアノテーションを通常通り付与

source: annotate your entity views with `@EntityView` and any other mapping annotation as usual
ja_jp: エンティティービューに `@EntityView` やその他のマッピングアノテーションを通常通りにアノテーションします

source: any other POJO that can be serializable to JSON
ja_jp: JSON にシリアル化できるその他の POJO

source: any other type
ja_jp: 他のタイプ

source: any variables
ja_jp: 任意の変数

source: application config application.yml
ja_jp: アプリケーション設定 application.yml

source: application.properties for TokenSecuredResource
ja_jp: TokenSecuredResource の application.properties

source: applying constraint information from entities to DDL
ja_jp: エンティティーからの制約情報を DDL に適用

source: are adaptable to real-world use cases.
ja_jp: 実際のユースケースに適応できます。

source: are annotated with `@io.quarkus.arc.Unremovable`, or
ja_jp: `@io.quarkus.arc.Unremovable` でアノテーションされているか

source: are concise and to the point. They state, describe, and inform.
ja_jp: 簡潔で、要点を押さえています。述べ、説明し、周知します。

source: are consistent (to the extent possible) with other reference guides. Following the template helps here.
ja_jp: 他のリファレンスガイドと (可能な限り) 整合しています。テンプレートに従うと整合性が取りやすくなります。

source: are excluded via the `quarkus.arc.unremovable-types` config property, or
ja_jp: `quarkus.arc.unremovable-types` コンフィグ・プロパティによって除外されているか

source: are kept up to date. While configuration reference material is generated, extension references that describe how configuration should be applied must be accurate to be useful.
ja_jp: 最新の状態に保たれています。設定リファレンス資料が作成されるとはいえ、設定の適用方法を説明するエクステンションリファレンスは正確かつ有用である必要があります。

source: are otherwise identified by Quarkus extensions.
ja_jp: Quarkusのエクステンションで識別されているか。

source: are practical (rather than complete).
ja_jp: 実用的 (完全ではない) です。

source: are reliable and consistent (they work for all users, every time).
ja_jp: 信頼性が高く、一貫性があります (常にすべてのユーザーに適用できる)。

source: arguably the safest way is to move `@RolesAllowed` annotation to the endpoint, as accessing `SecurityIdentity` from endpoint methods is never the blocking operation
ja_jp: エンドポイントメソッドから `SecurityIdentity` へのアクセスはブロック操作にならないため、 `@RolesAllowed` のアノテーションをエンドポイントに移動させるのが最も安全な方法であることは間違いありません。

source: article about https://edofic.com/posts/2021-09-12-podman-m1-amd64[running AMD64 images with Podman on Mac M1]
ja_jp: article about https://edofic.com/posts/2021-09-12-podman-m1-amd64[Mac M1 上の Podman での AMD64 イメージの実行] に関する記事

source: article about https://www.redhat.com/sysadmin/replace-docker-podman-macos[running Podman on Mac]
ja_jp: https://www.redhat.com/sysadmin/replace-docker-podman-macos[Mac 上での Podman の実行] に関する記事

source: artifact coordinates of conditional dependencies on other extensions.
ja_jp: 他のエクステンションへの条件付き依存関係のアーティファクト座標

source: as an argument to Maven/Gradle when launching the test. This will make the application wait until a remote JVM debugger is connected to port `5005`.
ja_jp: テストを起動するときに Maven/Gradle への引数として指定します。これにより、リモート JVM デバッガーがポート `5005` に接続されるまでアプリケーションが待機するようになります。

source: as explained above in section <<caching,Caching>>, you don't need to pick an implementation. A suitable implementation based on technologies from link:https://infinispan.org/[Infinispan] and link:https://github.com/ben-manes/caffeine[Caffeine] is included as a transitive dependency of the Hibernate ORM extension, and automatically integrated during the build.
ja_jp: <<caching,キャッシング>> の項で説明したように、実装を選択する必要はありません。 link:https://infinispan.org/[Infinispan]と link:https://github.com/ben-manes/caffeine[Caffeine] の技術をベースにした適切な実装は、Hibernate ORM拡張の推移依存関係に含まれており、ビルド時に自動的に統合されます。

source: as the response.
ja_jp: レスポンスを閉じます。

source: ask an extension to do work for another extension: e.g. an extension wanting to define a new CDI bean and asking the ArC extension to do so
ja_jp: エクステンションに別のエクステンションの動作を要求する。たとえば、新しい CDI Bean を定義するエクステンションの代わりに、ArC エクステンションにその定義を要求します。

source: ask your questions on https://stackoverflow.com/questions/tagged/quarkus[Stack Overflow].
ja_jp: https://stackoverflow.com/questions/tagged/quarkus[Stack Overflow] で質問

source: assign your consumer to a consumer group not used by any other application.
ja_jp: 他のアプリケーションで使用されていないコンシューマーグループへのコンシューマーの割り当て

source: assigns the consumer to:
ja_jp: コンシューマーを以下に割り当てます。

source: assume you have enough context to begin the task.
ja_jp: タスクを開始するのに十分なコンテキストがあると仮定します。

source: asynchronous
ja_jp: 非同期

source: authScheme is null
ja_jp: authScheme は null です。

source: auto-suggest - `.autosuggest()` (requires the https://redis.com/modules/redis-search/[RedisSearch] module on the server side).
ja_jp: auto-suggest - `.autosuggest()` (サーバー側に link:https://redis.com/modules/redis-search/[RedisSearch] モジュールが必要です)。

source: automatically converted to the selected config type (yaml or properties) at generation time depending on the selected extensions
ja_jp: 選択されたエクステンションに応じて、生成時に選択された設定タイプ（yamlまたはproperties）に自動的に変換されます

source: available Quarkus platforms, indicating which of those are currently recommended for new projects and/or as updates;
ja_jp: 利用可能なQuarkusプラットフォームのうち、どのプラットフォームが新規プロジェクトやアップデートに推奨されているか。

source: available non-platform extensions, indicating which Quarkus versions they are compatible with.
ja_jp: 利用可能なプラットフォーム以外のエクステンションについて、それらがどのQuarkusバージョンと互換性があるか。

source: available: Assistant is available but not yet configured.
ja_jp: available: アシスタントは利用可能ですが、まだ設定されていません。

source: bcc/eBPF is very extensible so it's easier to tailor make scripts to track specific metrics. The `bcc` project contains a `stackcount` program that can be used to count stack traces in similar way to what `perf` did in the previous section. But in some cases, it might be more useful to have other metrics other than number of calls to a system call. `malloc` is one such example. The number of `malloc` calls is not so important, but rather the size of the allocations. So rather than having a flamegraph showing sample counts, a flamegraph can be generated that shows bytes allocated.
ja_jp: bcc/eBPFは非常に拡張性が優れているため、特定のメトリクスを追跡するスクリプトを作るのが簡単です。 `bcc` プロジェクトには `stackcount` プログラムがあり、前のセクションで `perf` が行ったのと同様の方法でスタックトレースをカウントするために使用することができます。しかし、場合によっては、システムコールの呼び出し回数以外のメトリクスがあった方が便利なこともあります。 `malloc` はそのような例の1つです。 `malloc` の呼び出し回数はそれほど重要ではなく、むしろアロケーションの大きさが重要です。そのため、サンプル数を示すフレームグラフではなく、割り当てられたバイトを示すフレームグラフを生成することができます。

source: birthdate claim value
ja_jp: birthdate クレームの値

source: bloom - `.bloom()` (requires the https://redis.com/modules/redis-bloom/[RedisBloom] module on the server side)
ja_jp: bloom - `.bloom()` (サーバー側に link:https://redis.com/modules/redis-bloom/[RedisBloom] モジュールが必要)

source: build and run your project
ja_jp: プロジェクトをビルドおよび実行する

source: build time vs runtime in classic Java frameworks
ja_jp: 従来型の Java フレームワークにおけるビルド時と実行時の比較

source: building CLI tools, and you want to reduce the disk footprint,
ja_jp: CLIツールをビルドする場合。ディスクのフットプリントを減らしたい場合。

source: building small container images.
ja_jp: 小さなコンテナイメージをビルドする場合。

source: buildtool: The build tool (e.g. Maven, Gradle, Gradle with Kotlin DSL)
ja_jp: buildtool: ビルドツール（例：Maven、Gradle、Gradle with Kotlin DSL）

source: bulkhead
ja_jp: バルクヘッド

source: business rule task
ja_jp: ビジネスルールタスク

source: but overall, this release comes with a lot of nice things so we strongly recommend you to upgrade.
ja_jp: しかし、全体的には、今回のリリースには多くの優れた機能が搭載されていますので、アップグレードされることを強くお勧めします。

source: but users can also choose to expose one that might present a security risk under a different TCP port using a dedicated xref:management-interface-reference.adoc[management interface].
ja_jp: しかし、ユーザーは、セキュリティリスクをもたらす可能性のあるものを、専用の xref:management-interface-reference.adoc[管理インターフェイス] を使用して、別のTCPポートで公開することを選択することもできます。

source: but we haven't set them up yet.
ja_jp: ですが、まだ設定していません。

source: by default, the `groupId`, `version`, `quarkusVersion`, `namespaceId`, and `namespaceName` will be consistent with other Quarkus core extensions.
ja_jp: デフォルトでは、 `groupId`, `version`, `quarkusVersion`, `namespaceId`, `namespaceName` は、他のQuarkusコアエクステンションと一致します。

source: by programmatically registering a `ClientHeadersFactory` or a `ReactiveClientHeadersFactory` with the `QuarkusRestClientBuilder.clientHeadersFactory(factory)` method
ja_jp: `QuarkusRestClientBuilder.clientHeadersFactory(factory)` メソッドを使用して、 `ClientHeadersFactory` または `ReactiveClientHeadersFactory` をプログラムで登録する方法。

source: by registering a `ClientHeadersFactory` or a `ReactiveClientHeadersFactory` with the `@RegisterClientHeaders` annotation
ja_jp: `@RegisterClientHeaders` アノテーションを用いて `ClientHeadersFactory` または `ReactiveClientHeadersFactory` を登録する方法。

source: by specifying the value of the header by `@HeaderParam`
ja_jp: `@HeaderParam` でヘッダーの値を指定する方法。

source: by specifying the value of the header with `@ClientHeaderParam`
ja_jp: `@ClientHeaderParam` でヘッダーの値を指定する方法。

source: calling `Vertx::currentContext()`, which fails if the current thread is not a Vert.x thread.
ja_jp: `Vertx::currentContext()` を呼び出す。これは、現在のスレッドが Vert.x スレッドでない場合、失敗します。

source: calling `Vertx::getOrCreateContext()` either on the current thread or later when the scheduling request happens, or
ja_jp: 現在のスレッドまたは後でスケジュールリクエストが発生したときに `Vertx::getOrCreateContext()` を呼び出す、または

source: can be simplified to:
ja_jp: 次のように簡略化できます。

source: cannot update/remove
ja_jp: 更新/削除できません

source: categories under which the extension should appear on https://code.quarkus.io[code.quarkus.io], could be omitted, in which case the extension will still be listed but not under any specific category
ja_jp: https://code.quarkus.iocode.quarkus.io で表示されるべきカテゴリーを省略することができます。この場合、エクステンションは表示されますが、特定のカテゴリーには表示されません。

source: certain common files, such as `readme.md`, `src/main/resources/application.yml`, `src/main/resources/META-INF/resources/index.html` are generated from the collected fragments found in the selected codestarts for the project
ja_jp: `readme.md` , `src/main/resources/application.yml` , `src/main/resources/META-INF/resources/index.html` などの特定の共通ファイルは、プロジェクトに対して選択された Codestart で見つかった収集済みフラグメントから生成されます。

source: change `sayHello` method return type (use reactive or asynchronous data type)
ja_jp: `sayHello` メソッドの戻り値の型を変更する（リアクティブまたは非同期データ型を使用する）。

source: check whether extension dependencies conform to the Quarkus extension dependency model.
ja_jp: エクステンションの依存関係が Quarkus エクステンションの依存関係モデルに準拠しているかどうかを確認します。

source: classes for which a direct implementation of `org.apache.kafka.common.serialization.Serializer<T>` / `org.apache.kafka.common.serialization.Deserializer<T>` is present.
ja_jp: `org.apache.kafka.common.serialization.Serializer<T>` / `org.apache.kafka.common.serialization.Deserializer<T>` の直接実装があるクラス。

source: classes for which a subclass of `JsonbSerializer` / `JsonbDeserializer` is present, as described in <<jsonb-serialization>>
ja_jp: <<jsonb-serialization>> で説明されているように、 `JsonbSerializer` / `JsonbDeserializer` のサブクラスが存在するクラス。

source: classes for which a subclass of `ObjectMapperSerializer` / `ObjectMapperDeserializer` is present, as described in <<jackson-serialization>>
ja_jp: <<jackson-serialization>> で説明されているように、 `ObjectMapperSerializer` / `ObjectMapperDeserializer` のサブクラスが存在するクラス。

source: classes generated from Avro schemas, as well as Avro `GenericRecord`, if Confluent or Apicurio Registry _serde_ is present
ja_jp: Confluent または Apicurio Registry _serde_ が存在する場合、Avro スキーマから生成されるクラスと Avro `GenericRecord` から生成されるクラス

source: classes generated from Avro schemas, as well as Avro `GenericRecord`, will be configured with `AVRO` schema type
ja_jp: Avro スキーマから生成されたクラスと Avro `GenericRecord` は、 `AVRO` スキーマタイプで設定されます。

source: classes generated from Protobuf schemas, will be configured with `PROTOBUF` schema type
ja_jp: Protobuf スキーマから生成されたクラスは、 `PROTOBUF` スキーマタイプで設定されます。

source: classpath resource
ja_jp: クラスパスリソース

source: closing resources, flushing data
ja_jp: リソースのクローズ、データのフラッシュ

source: code: Any Quarkus extension can provide starter code. The user can decide to activate it or not.
ja_jp: code: どのQuarkusエクステンションもスターターコードを提供可能です。ユーザーはそれを有効にするかどうかを決めることができます。

source: code: This will be rendered in a code editor
ja_jp: code: これはコードエディターでレンダリングされます

source: compile the application with the flag `-Dnet.bytebuddy.experimental`
ja_jp: `-Dnet.bytebuddy.experimental` フラグを付けてコンパイルをする

source: complete (Multi only)
ja_jp: complete (Multi のみ)

source: condition that must be resolved to `true` by a class implementing `java.util.function.BooleanSupplier`
ja_jp: `java.util.function.BooleanSupplier` を実装したクラスが `true` に解決しなければならない条件

source: conditional dependencies that should be evaluated only in dev mode;
ja_jp: 開発モードでのみ評価される条件付き依存関係。

source: conditional dependency configuration element
ja_jp: 条件付き依存関係の設定要素

source: config: The config type (e.g. yaml, properties)
ja_jp: config: 設定の種類（例：yaml、properties）

source: configuration of the condition which will have to be satisfied for this extension to be included into a Quarkus application expressed as a list of artifacts that must be present among the application dependencies;
ja_jp: このエクステンションがQuarkusアプリケーションに含まれるために満たさなければならない条件の設定で、アプリケーションの依存関係の中に存在しなければならないアーティファクトのリストとして表現

source: configuration of the dependency condition which will have to be satisfied for this extension to be added to a Quarkus application expressed as a list of artifacts that must be present among the application dependencies;
ja_jp: このエクステンションを Quarkus アプリケーションに追加するために満たす必要のある依存関係条件の設定。アプリケーション依存関係の中に存在する必要があるアーティファクトのリストとして表現されます。

source: configure a datasource, or multiple datasources
ja_jp: 1 つまたは複数のデータソースを設定する

source: consume that database configuration (e.g. a connection pool extension or an ORM extension)
ja_jp: データベースの設定を利用する（例：コネクションプールエクステンション、ORMエクステンション）

source: contains the right set of dependencies (glibc, libstdc++, zlib)
ja_jp: 正しい依存関係のセット（glibc, libstdc++, zlib）を含んでいる

source: content: The content of this item (or file)
ja_jp: content: このアイテム (またはファイル) の内容

source: context
ja_jp: コンテキスト

source: controlling the emission thread - https://smallrye.io/smallrye-mutiny/guides/emit-subscription
ja_jp: 排出スレッドの管理 - https://smallrye.io/smallrye-mutiny/guides/emit-subscription

source: controlling the emission thread - https://smallrye.io/smallrye-mutiny/latest/guides/emit-on-vs-run-subscription-on/
ja_jp: 排出スレッドの制御 - https://smallrye.io/smallrye-mutiny/latest/guides/emit-on-vs-run-subscription-on/

source: copy `privateKey.pem` from the `integration-tests/oidc-tenancy` in the `main` Quarkus repository and use a test code similar to the one in the `Wiremock` section above to generate JWT tokens. You can use your own test keys if preferred.
ja_jp: `integration-tests/oidc-tenancy` から `main` のQuarkusリポジトリに `privateKey.pem` をコピーし、上記 `Wiremock` のセクションと同様のテストコードを使用してJWTトークンを生成します。必要であれば、独自のテストキーを使用することもできます。

source: count-min - `.countmin()` (requires the https://redis.com/modules/redis-bloom/[RedisBloom] module on the server side, which also provides the count-min filter commands)
ja_jp: count-min - `.countmin()` （サーバー側に link:https://redis.com/modules/redis-bloom/[RedisBloom] モジュールが必要で、count-minフィルターコマンドも提供されます。）

source: craft some code and https://github.com/quarkusio/quarkus/pulls[push a PR];
ja_jp: コードを作成し、 https://github.com/quarkusio/quarkus/pulls[プルリクエスト] を送信

source: create an environment variable for `SMALLRYE_CONFIG_LOCATIONS`
ja_jp: `SMALLRYE_CONFIG_LOCATIONS` の環境変数を作成する

source: create new authors and books and search for them too
ja_jp: 新しい著者や書籍を作成し、それらを検索することもできます

source: create the native executable with:
ja_jp: 以下でネイティブの実行可能ファイルを作成します。

source: create the relevant rules (rows) entries as per the above screenshot.
ja_jp: 上記のスクリーンショットのように、関連するルール（行）のエントリを作成します。

source: cuckoo - `.cuckoo()` (requires the https://redis.com/modules/redis-bloom/[rRedisBloom] module on the server side, which also provides the cuckoo filter commands)
ja_jp: cuckoo - `.cuckoo()` (サーバ側に link:https://redis.com/modules/redis-bloom/[rRedisBloom] モジュールが必要で、cuckoo のフィルタコマンドも提供します)

source: curl Command for /secured/roles-allowed With JWT
ja_jp: JWT を含む /secured/roles-allowed の curl コマンド

source: curl command for /secured/permit-all
ja_jp: /secured/permit-all に対するcurl コマンド

source: curl command for /secured/roles-allowed
ja_jp: /secured/roles-allowed の curl コマンド
